public/benchmarks/20260213_234923/run_variant_a_20260213_234923.txt
/opt/homebrew/opt/openjdk@21/bin/java  -classpath /Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/conf:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/HdrHistogram-2.1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/bsh-2.0b4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/core-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/htrace-core4-4.1.0-incubating.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-core-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jackson-mapper-asl-1.9.4.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/jcommander-1.12.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/junit-3.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/snakeyaml-1.6.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/lib/testng-6.1.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-accessanalyzer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-acmpca-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-alexaforbusiness-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-amplify-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-api-gateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewaymanagementapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-apigatewayv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationautoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-applicationinsights-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appmesh-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appstream-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-appsync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-athena-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-augmentedairuntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscaling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-autoscalingplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-backup-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-batch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-budgets-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-chime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloud9-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-clouddirectory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudfront-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudhsmv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudtrail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cloudwatchmetrics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeartifact-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codebuild-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codecommit-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codedeploy-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codeguruprofiler-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codegurureviewer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codepipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestar-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarconnections-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-codestarnotifications-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidentity-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitoidp-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-cognitosync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehend-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-comprehendmedical-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-computeoptimizer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-config-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-connectparticipant-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-core-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costandusagereport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-costexplorer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dataexchange-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datapipeline-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-datasync-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dax-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-detective-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-devicefarm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-directory-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-discovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dlm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-docdb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-dynamodb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ebs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ec2instanceconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ecs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-efs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticache-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticbeanstalk-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticinference-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticloadbalancingv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elasticsearch-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-elastictranscoder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-emr-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-eventbridge-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-events-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecast-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-forecastquery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-frauddetector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-fsx-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-gamelift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glacier-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-globalaccelerator-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-glue-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-greengrass-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-groundstation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-guardduty-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-health-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-honeycode-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iam-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-imagebuilder-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-importexport-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-inspector-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickdevices-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iot1clickprojects-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ioteventsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotjobsdataplane-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsecuretunneling-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotsitewise-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-iotthingsgraph-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kafka-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kendra-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesis-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisanalyticsv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideo-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kinesisvideosignalingchannels-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-kms-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lakeformation-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lambda-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lex-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lexmodelbuilding-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-licensemanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-lightsail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-logs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-machinelearning-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-macie2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-managedblockchain-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacecommerceanalytics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplaceentitlement-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-marketplacemeteringservice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mechanicalturkrequester-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconnect-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediaconvert-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-medialive-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackage-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediapackagevod-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastore-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediastoredata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mediatailor-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-migrationhubconfig-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mobile-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-models-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-mq-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-neptune-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-networkmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworks-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-opsworkscm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-organizations-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-outposts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalize-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeevents-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-personalizeruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpoint-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointemail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pinpointsmsvoice-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-polly-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-pricing-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-qldbsession-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-quicksight-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ram-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rds-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rdsdata-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-redshift-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-rekognition-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroups-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-resourcegroupstaggingapi-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-robomaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-route53resolver-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-s3control-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemaker-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sagemakerruntime-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-savingsplans-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-schemas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-secretsmanager-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-securityhub-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-serverlessapplicationrepository-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servermigration-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicecatalog-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicediscovery-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-servicequotas-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ses-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sesv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-shield-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-signer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpledb-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-simpleworkflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-snowball-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sns-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sqs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssm-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sso-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-ssooidc-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-stepfunctions-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-storagegateway-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-sts-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-support-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-swf-libraries-1.11.22.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-synthetics-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-textract-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transcribe-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-transfer-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-translate-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-waf-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-wafv2-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workdocs-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-worklink-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmail-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workmailmessageflow-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-workspaces-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/aws-java-sdk-xray-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-codec-1.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/commons-logging-1.1.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/dynamodb-binding-0.18.0-shivam-SNAPSHOT.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpclient-4.5.9.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/httpcore-4.4.11.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/ion-java-1.0.2.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-annotations-2.6.0.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-core-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-databind-2.6.7.3.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jackson-dataformat-cbor-2.6.7.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/jmespath-java-1.11.812.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/joda-time-2.8.1.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/log4j-1.2.17.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-buffer-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-codec-http-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-common-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-handler-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-resolver-4.1.44.Final.jar:/Users/shivam.dwivedi/Documents/personal projects/shvm-db/benchmarks/ycsb-dist/dynamodb-binding/lib/netty-transport-4.1.44.Final.jar site.ycsb.Client -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_a -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
Command line: -t -db site.ycsb.db.DynamoDBClient -P ./workloads/variant_a -p dynamodb.endpoint=http://localhost:8787/api -p dynamodb.primaryKey=PK -p dynamodb.primaryKeyType=HASH -p dynamodb.awsCredentialsFile=fake-aws-credentials.properties -s
YCSB Client 0.18.0-shivam-SNAPSHOT

Loading workload...
Starting test.
2026-02-13 23:49:33:753 0 sec: 0 operations; est completion in 0 second 
0    [Thread-2] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-3] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-8] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-4] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
DBWrapper: report latency for each error is false and specific error codes to track for latency are: []
0    [Thread-6] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-7] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-9] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
0    [Thread-5] INFO  site.ycsb.db.DynamoDBClient  -dynamodb connection created with http://localhost:8787/api
2026-02-13 23:49:43:722 10 sec: 5223 operations; 522.14 current ops/sec; est completion in 48 seconds [READ: Count=2069, Max=119551, Min=3586, Avg=14139.46, 50=11151, 90=23407, 99=47903, 99.9=118847, 99.99=119551] [INSERT: Count=1061, Max=119935, Min=2640, Avg=14849.87, 50=12447, 90=22767, 99=51359, 99.9=119871, 99.99=119935] [UPDATE: Count=2094, Max=119871, Min=3370, Avg=15072.25, 50=12399, 90=24095, 99=48223, 99.9=90047, 99.99=119871] 
2026-02-13 23:49:53:720 20 sec: 10927 operations; 570.51 current ops/sec; est completion in 35 seconds [READ: Count=2299, Max=88767, Min=3040, Avg=13077.51, 50=10471, 90=22303, 99=39935, 99.9=77055, 99.99=88767] [INSERT: Count=1157, Max=91903, Min=3222, Avg=14856.33, 50=12231, 90=23999, 99=45663, 99.9=83903, 99.99=91903] [UPDATE: Count=2248, Max=93503, Min=3460, Avg=14544.34, 50=12055, 90=23791, 99=43903, 99.9=78527, 99.99=93503] 
2026-02-13 23:50:03:722 30 sec: 16832 operations; 590.38 current ops/sec; est completion in 24 seconds [READ: Count=2407, Max=104639, Min=2896, Avg=12602.88, 50=10095, 90=20719, 99=45215, 99.9=90943, 99.99=104639] [INSERT: Count=1128, Max=105151, Min=3914, Avg=14387.36, 50=11511, 90=22687, 99=58111, 99.9=99327, 99.99=105151] [UPDATE: Count=2371, Max=104831, Min=3148, Avg=14087.85, 50=11423, 90=22431, 99=45919, 99.9=88511, 99.99=104831] 
2026-02-13 23:50:13:722 40 sec: 22756 operations; 592.4 current ops/sec; est completion in 13 seconds [READ: Count=2361, Max=83391, Min=2892, Avg=12518.81, 50=10007, 90=20319, 99=50591, 99.9=70783, 99.99=83391] [INSERT: Count=1146, Max=70655, Min=3150, Avg=13894.2, 50=11463, 90=22511, 99=47743, 99.9=70463, 99.99=70655] [UPDATE: Count=2415, Max=83647, Min=3282, Avg=14265.92, 50=11487, 90=22895, 99=51199, 99.9=82047, 99.99=83647] 
2026-02-13 23:50:23:725 50 sec: 28431 operations; 567.39 current ops/sec; est completion in 3 second [READ: Count=2303, Max=96383, Min=2892, Avg=13304.52, 50=10231, 90=21279, 99=53183, 99.9=91327, 99.99=96383] [INSERT: Count=1135, Max=96895, Min=3104, Avg=14427.17, 50=11671, 90=23471, 99=48191, 99.9=78271, 99.99=96895] [UPDATE: Count=2240, Max=94399, Min=3286, Avg=14737.93, 50=11815, 90=24047, 99=53919, 99.9=71103, 99.99=94399] 
2026-02-13 23:50:26:664 52 sec: 30000 operations; 533.67 current ops/sec; [READ: Count=625, Max=75263, Min=2142, Avg=13307.7, 50=10455, 90=21791, 99=48031, 99.9=75263, 99.99=75263] [CLEANUP: Count=8, Max=1, Min=0, Avg=0.5, 50=0, 90=1, 99=1, 99.9=1, 99.99=1] [INSERT: Count=336, Max=88511, Min=2666, Avg=15618.49, 50=12319, 90=25311, 99=73727, 99.9=88511, 99.99=88511] [UPDATE: Count=605, Max=87615, Min=2356, Avg=14616.35, 50=11711, 90=23711, 99=46431, 99.9=87615, 99.99=87615] 
[OVERALL], RunTime(ms), 52945
[OVERALL], Throughput(ops/sec), 566.6257436962886
[TOTAL_GCS_G1_Young_Generation], Count, 11
[TOTAL_GC_TIME_G1_Young_Generation], Time(ms), 29
[TOTAL_GC_TIME_%_G1_Young_Generation], Time(%), 0.05477382189064123
[TOTAL_GCS_G1_Concurrent_GC], Count, 0
[TOTAL_GC_TIME_G1_Concurrent_GC], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Concurrent_GC], Time(%), 0.0
[TOTAL_GCS_G1_Old_Generation], Count, 0
[TOTAL_GC_TIME_G1_Old_Generation], Time(ms), 0
[TOTAL_GC_TIME_%_G1_Old_Generation], Time(%), 0.0
[TOTAL_GCs], Count, 11
[TOTAL_GC_TIME], Time(ms), 29
[TOTAL_GC_TIME_%], Time(%), 0.05477382189064123
[READ], Operations, 12064
[READ], AverageLatency(us), 13110.85949933687
[READ], MinLatency(us), 2142
[READ], MaxLatency(us), 119551
[READ], 50thPercentileLatency(us), 10327
[READ], 90thPercentileLatency(us), 21679
[READ], 95thPercentileLatency(us), 28943
[READ], 99thPercentileLatency(us), 47423
[READ], 99.9PercentileLatency(us), 90111
[READ], Return=OK, 12064
[CLEANUP], Operations, 8
[CLEANUP], AverageLatency(us), 0.5
[CLEANUP], MinLatency(us), 0
[CLEANUP], MaxLatency(us), 1
[CLEANUP], 50thPercentileLatency(us), 0
[CLEANUP], 90thPercentileLatency(us), 1
[CLEANUP], 95thPercentileLatency(us), 1
[CLEANUP], 99thPercentileLatency(us), 1
[CLEANUP], 99.9PercentileLatency(us), 1
[INSERT], Operations, 5963
[INSERT], AverageLatency(us), 14542.821398624854
[INSERT], MinLatency(us), 2640
[INSERT], MaxLatency(us), 119935
[INSERT], 50thPercentileLatency(us), 11879
[INSERT], 90thPercentileLatency(us), 23183
[INSERT], 95thPercentileLatency(us), 30175
[INSERT], 99thPercentileLatency(us), 52287
[INSERT], 99.9PercentileLatency(us), 99327
[INSERT], Return=OK, 5963
[UPDATE], Operations, 11973
[UPDATE], AverageLatency(us), 14529.971519251649
[UPDATE], MinLatency(us), 2356
[UPDATE], MaxLatency(us), 119871
[UPDATE], 50thPercentileLatency(us), 11823
[UPDATE], 90thPercentileLatency(us), 23567
[UPDATE], 95thPercentileLatency(us), 30863
[UPDATE], 99thPercentileLatency(us), 48415
[UPDATE], 99.9PercentileLatency(us), 87615
[UPDATE], Return=OK, 11973